sysbench_test_PostgreSQL_Write_Intensive.log
========================================
Sysbench Test Parameters:
TABLES=10, TABLE_SIZE=100000, THREADS=16, TIME=300, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=10 --table-size=100000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 100000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 100000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 100000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 100000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 100000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 100000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 100000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 100000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 100000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 100000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=10 --table-size=100000 --threads=16 --time=300 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1766.07 qps: 35367.31 (r/w/o: 24761.32/7067.96/3538.03) lat (ms,95%): 9.39 err/s: 1.40 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1765.30 qps: 35331.17 (r/w/o: 24733.88/7062.09/3535.20) lat (ms,95%): 10.09 err/s: 1.40 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1746.77 qps: 34973.77 (r/w/o: 24482.66/6992.47/3498.64) lat (ms,95%): 10.09 err/s: 1.60 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1729.93 qps: 34617.07 (r/w/o: 24234.70/6917.21/3465.16) lat (ms,95%): 10.84 err/s: 1.60 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1747.97 qps: 34972.51 (r/w/o: 24480.71/6991.06/3500.73) lat (ms,95%): 10.84 err/s: 1.30 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1750.01 qps: 35032.91 (r/w/o: 24525.58/7003.52/3503.81) lat (ms,95%): 10.09 err/s: 0.70 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1762.13 qps: 35277.97 (r/w/o: 24698.80/7048.91/3530.26) lat (ms,95%): 9.91 err/s: 2.10 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1778.71 qps: 35588.07 (r/w/o: 24911.92/7115.13/3561.02) lat (ms,95%): 10.09 err/s: 0.90 reconn/s: 0.00
[ 90s ] thds: 16 tps: 1736.40 qps: 34738.48 (r/w/o: 24318.06/6945.12/3475.31) lat (ms,95%): 11.65 err/s: 0.60 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1738.68 qps: 34800.21 (r/w/o: 24361.32/6956.82/3482.06) lat (ms,95%): 9.39 err/s: 1.20 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1764.69 qps: 35308.05 (r/w/o: 24719.63/7055.65/3532.78) lat (ms,95%): 9.39 err/s: 1.20 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1716.91 qps: 34353.28 (r/w/o: 24046.10/6869.76/3437.43) lat (ms,95%): 11.87 err/s: 1.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 1737.81 qps: 34785.46 (r/w/o: 24352.18/6953.55/3479.73) lat (ms,95%): 10.27 err/s: 1.30 reconn/s: 0.00
[ 140s ] thds: 16 tps: 1728.78 qps: 34589.79 (r/w/o: 24216.31/6911.52/3461.96) lat (ms,95%): 11.04 err/s: 1.20 reconn/s: 0.00
[ 150s ] thds: 16 tps: 1724.12 qps: 34497.00 (r/w/o: 24147.38/6898.58/3451.04) lat (ms,95%): 11.65 err/s: 0.60 reconn/s: 0.00
[ 160s ] thds: 16 tps: 1720.89 qps: 34446.08 (r/w/o: 24114.02/6885.68/3446.39) lat (ms,95%): 10.27 err/s: 1.20 reconn/s: 0.00
[ 170s ] thds: 16 tps: 1760.89 qps: 35223.39 (r/w/o: 24656.86/7040.76/3525.78) lat (ms,95%): 10.09 err/s: 0.90 reconn/s: 0.00
[ 180s ] thds: 16 tps: 1759.21 qps: 35218.54 (r/w/o: 24655.37/7040.35/3522.82) lat (ms,95%): 9.91 err/s: 1.40 reconn/s: 0.00
[ 190s ] thds: 16 tps: 1744.00 qps: 34914.18 (r/w/o: 24441.75/6978.72/3493.71) lat (ms,95%): 10.09 err/s: 1.80 reconn/s: 0.00
[ 200s ] thds: 16 tps: 1737.10 qps: 34761.13 (r/w/o: 24337.22/6945.81/3478.10) lat (ms,95%): 10.84 err/s: 1.30 reconn/s: 0.00
[ 210s ] thds: 16 tps: 1765.09 qps: 35313.94 (r/w/o: 24718.49/7061.67/3533.78) lat (ms,95%): 9.39 err/s: 1.50 reconn/s: 0.00
[ 220s ] thds: 16 tps: 1707.41 qps: 34191.82 (r/w/o: 23938.69/6833.02/3420.11) lat (ms,95%): 11.24 err/s: 1.50 reconn/s: 0.00
[ 230s ] thds: 16 tps: 1706.70 qps: 34148.93 (r/w/o: 23904.72/6827.51/3416.70) lat (ms,95%): 12.08 err/s: 0.70 reconn/s: 0.00
[ 240s ] thds: 16 tps: 1765.20 qps: 35315.27 (r/w/o: 24721.48/7059.89/3533.90) lat (ms,95%): 9.39 err/s: 0.60 reconn/s: 0.00
[ 250s ] thds: 16 tps: 1759.40 qps: 35198.34 (r/w/o: 24639.13/7036.61/3522.60) lat (ms,95%): 9.22 err/s: 0.90 reconn/s: 0.00
[ 260s ] thds: 16 tps: 1764.50 qps: 35313.46 (r/w/o: 24721.44/7058.61/3533.41) lat (ms,95%): 9.22 err/s: 1.20 reconn/s: 0.00
[ 270s ] thds: 16 tps: 1770.29 qps: 35434.99 (r/w/o: 24807.62/7081.48/3545.89) lat (ms,95%): 9.22 err/s: 1.50 reconn/s: 0.00
[ 280s ] thds: 16 tps: 1753.80 qps: 35087.97 (r/w/o: 24562.78/7014.79/3510.40) lat (ms,95%): 9.22 err/s: 0.70 reconn/s: 0.00
[ 290s ] thds: 16 tps: 1752.39 qps: 35078.15 (r/w/o: 24556.89/7011.47/3509.78) lat (ms,95%): 9.91 err/s: 1.70 reconn/s: 0.00
[ 300s ] thds: 16 tps: 1759.30 qps: 35191.18 (r/w/o: 24634.96/7034.52/3521.71) lat (ms,95%): 9.91 err/s: 0.70 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7344050
        write:                           2097038
        other:                           1049698
        total:                           10490786
    transactions:                        524218 (1747.33 per sec.)
    queries:                             10490786 (34968.02 per sec.)
    ignored errors:                      357    (1.19 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0101s
    total number of events:              524218

Latency (ms):
         min:                                  4.57
         avg:                                  9.15
         max:                                111.05
         95th percentile:                     10.09
         sum:                            4798652.63

Threads fairness:
    events (avg/stddev):           32763.6250/21.13
    execution time (avg/stddev):   299.9158/0.01

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=10 --table-size=100000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241221_141017.log